Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПродуктов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницаИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/ЗаказыПоставщику/Ext/Module.bsl
Функция ПолучитьЗаказы()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПоставщикуПродукты.Продукт) КАК ПродуктПредставление,
		|	ЗаказПоставщикуПродукты.Количество КАК Количество,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПоставщикуПродукты.Ссылка) КАК ПредставлениеЗаказа,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПоставщикуПродукты.Ссылка.Поставщик) КАК ПоставщикПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПоставщикуПродукты.Ссылка.Менеджер) КАК МенеджерПредставление,
		|	ЗаказПоставщикуПродукты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПоставщику.Продукты КАК ЗаказПоставщикуПродукты
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Заказы = ПолучитьОбъектXDTO("Заказы");
	
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		Заказ = ПолучитьОбъектXDTO("Заказ");
		Заказ.ПредставлениеЗаказа = ВыборкаСсылка.ПредставлениеЗаказа;
		Заказ.Поставщик = ВыборкаСсылка.ПоставщикПредставление;
		Заказ.Менеджер = ВыборкаСсылка.МенеджерПредставление;
		
		
		Продукты = ПолучитьОбъектXDTO("Продукты");
		Заказ.Продукты = Продукты;
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаПродукты = ПолучитьОбъектXDTO("СтрокаПродукты");
			СтрокаПродукты.Продукт = ВыборкаДетальныеЗаписи.ПродуктПредставление;
			СтрокаПродукты.Количество = ВыборкаДетальныеЗаписи.Количество;
			
			Заказ.Продукты.СтрокаПродукты.Добавить(СтрокаПродукты);
			
		КонецЦикла;
		
		 
		Заказы.Заказ.Добавить(Заказ);
		
	КонецЦикла;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Заказы);
	
	ТекстXML = ЗаписьXML.Закрыть();
	Возврат ТекстXML;
	
	
	//Возврат Заказы;	
	
КонецФункции

Функция ПолучитьОбъектXDTO(НаименованиеОбъекта)
		
	Тип = ФабрикаXDTO.Тип("http://localhost/shawarman1", НаименованиеОбъекта);
	Возврат ФабрикаXDTO.Создать(Тип);  
	
КонецФункции
